In [1]:
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd

sns.set()

In [33]:
np.random.seed(4711)

df = pd.DataFrame({'F_1': np.random.randint(1,6,6),
                  'F_2' : np.random.randint(1,6,6),
                  'M_1' : np.random.randint(1,6,6),
                  'M_2' : np.random.randint(1,6,6)})

midx = pd.MultiIndex.from_arrays([[2000,2000,2001,2001,2002,2002],[1,2,1,2,1,2]])

df = df.set_index(midx)
df.index.names=('year','half')
df

           F_1  F_2  M_1  M_2
year half
2000 1       5    1    1    3
     2       2    5    3    2
2001 1       2    2    5    1
     2       4    1    4    1
2002 1       5    1    3    4
     2       4    4    4    1

In [34]:
def gender(col):
    if 'F' in col:
        return 'F'
    
    if 'M' in col:
        return 'M'

In [56]:

g = df.groupby(gender,axis=1)
g.apply(np.sum,axis=1)

           F  M
year half
2000 1     6  4
     2     7  5
2001 1     4  6
     2     5  5
2002 1     6  7
     2     8  5

In [66]:
groupby_sum = g.sum()
groupby_sum

           F  M
year half
2000 1     6  4
     2     7  5
2001 1     4  6
     2     5  5
2002 1     6  7
     2     8  5

In [67]:
groupby_transform_sum = g.transform(np.sum)
groupby_transform_sum

           F_1  F_2  M_1  M_2
year half
2000 1       6    6    4    4
     2       7    7    5    5
2001 1       4    4    6    6
     2       5    5    5    5
2002 1       6    6    7    7
     2       8    8    5    5

In [68]:
df / groupby_transform_sum

                F_1       F_2       M_1       M_2
year half
2000 1     0.833333  0.166667  0.250000  0.750000
     2     0.285714  0.714286  0.600000  0.400000
2001 1     0.500000  0.500000  0.833333  0.166667
     2     0.800000  0.200000  0.800000  0.200000
2002 1     0.833333  0.166667  0.428571  0.571429
     2     0.500000  0.500000  0.800000  0.200000